cook_book = [
  ['салат',
      [
        ['картофель', 100, 'гр.'],
        ['морковь', 50, 'гр.'],
        ['огурцы', 50, 'гр.'],
        ['горошек', 30, 'гр.'],
        ['майонез', 70, 'мл.'],
      ]
  ],
  ['пицца',  
      [
        ['сыр', 50, 'гр.'],
        ['томаты', 50, 'гр.'],
        ['тесто', 100, 'гр.'],
        ['бекон', 30, 'гр.'],
        ['колбаса', 30, 'гр.'],
        ['грибы', 20, 'гр.'],
      ],
  ],
  ['фруктовый десерт',
      [
        ['хурма', 60, 'гр.'],
        ['киви', 60, 'гр.'],
        ['творог', 60, 'гр.'],
        ['сахар', 10, 'гр.'],
        ['мед', 50, 'мл.'],  
      ]
  ]
]
person = 5

for item in cook_book:
  print(f'\n{item[0].capitalize()}:')
  for item2 in item[1]:
   print(item2[0] +", "+ str(item2[1]*person)+str(item2[2]))
  

# must shows like this
#  Салат:
#  картофель, 500гр.
#  морковь, 250гр.
#  огурцы, 250гр.
#  горошек, 150гр.
#  майонез, 350мл. 

